In [1]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [2]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [3]:
df['FlightNumber'].iloc[1] =10055
df['FlightNumber'].iloc[3] =10075
df['FlightNumber'] = [int(i) for i in df['FlightNumber']]

C:\Users\aayush\anaconda3\lib\site-packages\pandas\core\indexing.py:1637: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

In [4]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [5]:
df_from= pd.DataFrame(df['From_To'].iloc[i].split('_')[0] for i in range(len(df['From_To'])))
df_to= pd.DataFrame(df['From_To'].iloc[i].split('_')[1] for i in range(len(df['From_To'])))

In [6]:
df_from

          0
0    LoNDon
1    MAdrid
2    londON
3  Budapest
4  Brussels

In [7]:
df_to

           0
0      paris
1      miLAN
2  StockhOlm
3      PaRis
4     londOn

3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [8]:
df1 = pd.DataFrame(df['From_To'].iloc[i].split('_')[0].capitalize() for i in range(len(df['From_To'])))
df1.columns=['City']

In [9]:
df1

       City
0    London
1    Madrid
2    London
3  Budapest
4  Brussels

4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [10]:
df.drop('From_To',axis=1,inplace=True)

In [11]:
frame = [df,df1]
df = pd.concat(frame,axis=1)
df

   FlightNumber  RecentDelays              Airline      City
0         10045      [23, 47]               KLM(!)    London
1         10055            []    <Air France> (12)    Madrid
2         10065  [24, 43, 87]  (British Airways. )    London
3         10075          [13]       12. Air France  Budapest
4         10085      [67, 32]          "Swiss Air"  Brussels

5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.

Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [12]:
df

   FlightNumber  RecentDelays              Airline      City
0         10045      [23, 47]               KLM(!)    London
1         10055            []    <Air France> (12)    Madrid
2         10065  [24, 43, 87]  (British Airways. )    London
3         10075          [13]       12. Air France  Budapest
4         10085      [67, 32]          "Swiss Air"  Brussels

In [13]:
lst=[]
for i in range(len(df['RecentDelays'])):
    lst.append(df['RecentDelays'].iloc[i])
lst

df["delay_1"] = ""
df["delay_2"] = ""
df["delay_3"] = ""

In [14]:
lst

[[23, 47], [], [24, 43, 87], [13], [67, 32]]

In [15]:
n=3
for j in lst:
    while len(j)<3:
        j.append(np.nan)

In [16]:
lst

[[23, 47, nan], [nan, nan, nan], [24, 43, 87], [13, nan, nan], [67, 32, nan]]

In [17]:
df['delay_1'] =[lst[i][0] for i in range(len(lst))] 
df['delay_2'] =[lst[i][1] for i in range(len(lst))] 
df['delay_3'] =[lst[i][2] for i in range(len(lst))]

In [18]:
df

,FlightNumber,RecentDelays,Airline,City,delay_1,delay_2,delay_3
0,10045,"[23, 47, nan]",KLM(!),London,23.0,47.0,NaN
1,10055,"[nan, nan, nan]",<Air France> (12),Madrid,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),London,24.0,43.0,87.0
3,10075,"[13, nan, nan]",12. Air France,Budapest,13.0,NaN,NaN
4,10085,"[67, 32, nan]","""Swiss Air""",Brussels,67.0,32.0,NaN

In [20]:
df.drop('RecentDelays',inplace=True,axis=1)

In [21]:
df

   FlightNumber              Airline      City  delay_1  delay_2  delay_3
0         10045               KLM(!)    London     23.0     47.0      NaN
1         10055    <Air France> (12)    Madrid      NaN      NaN      NaN
2         10065  (British Airways. )    London     24.0     43.0     87.0
3         10075       12. Air France  Budapest     13.0      NaN      NaN
4         10085          "Swiss Air"  Brussels     67.0     32.0      NaN